Revit 2027 API
RebarConstraintsManager.GetAllHandles Method
 Gets all RebarConstrainedHandles of this bar.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<RebarConstrainedHandle> GetAllHandles()
Public Function GetAllHandles As IList(Of RebarConstrainedHandle)
public:
IList<RebarConstrainedHandle^>^ GetAllHandles()
member GetAllHandles : unit -> IList<RebarConstrainedHandle>
Return Value
IList<RebarConstrainedHandle>
 All RebarConstrainedHandle objects will be returned, regardless of whether there are constraints associated to them.
Exceptions
Exception | Condition
InvalidOperationException |  The RebarConstraintsManager does not manage a valid Rebar element.
See Also
Reference
RebarConstraintsManager Class
Autodesk.Revit.DB.Structure Namespace